### data cleaning and preparation

In [2]:
import numpy as np
import pandas as pd

In [3]:
# handling missing data
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [6]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = pd.Series([1, 2, None], dtype = "float64")
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.],
                     [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan],
                     [np.nan, 6.5, 3]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.392594       NaN       NaN
1 -0.579963       NaN       NaN
2  0.780445       NaN -0.172493
3  0.461483       NaN -1.891739
4 -0.204563 -0.445887  0.078018
5  0.813432  0.103141  0.276979
6  0.764562 -0.334953 -0.102211

In [14]:
df.dropna()

          0         1         2
4 -0.204563 -0.445887  0.078018
5  0.813432  0.103141  0.276979
6  0.764562 -0.334953 -0.102211

In [15]:
df.dropna(thresh = 2)

          0         1         2
2  0.780445       NaN -0.172493
3  0.461483       NaN -1.891739
4 -0.204563 -0.445887  0.078018
5  0.813432  0.103141  0.276979
6  0.764562 -0.334953 -0.102211

In [16]:
df.fillna(0)

          0         1         2
0  0.392594  0.000000  0.000000
1 -0.579963  0.000000  0.000000
2  0.780445  0.000000 -0.172493
3  0.461483  0.000000 -1.891739
4 -0.204563 -0.445887  0.078018
5  0.813432  0.103141  0.276979
6  0.764562 -0.334953 -0.102211

In [17]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.392594  0.500000  0.000000
1 -0.579963  0.500000  0.000000
2  0.780445  0.500000 -0.172493
3  0.461483  0.500000 -1.891739
4 -0.204563 -0.445887  0.078018
5  0.813432  0.103141  0.276979
6  0.764562 -0.334953 -0.102211

In [18]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.063541  0.356909 -0.273050
1  1.465576 -0.990594 -0.524196
2 -0.409368       NaN -1.737939
3  1.497492       NaN  0.502291
4 -0.093612       NaN       NaN
5  0.474517       NaN       NaN

In [19]:
df.ffill()

          0         1         2
0 -0.063541  0.356909 -0.273050
1  1.465576 -0.990594 -0.524196
2 -0.409368 -0.990594 -1.737939
3  1.497492 -0.990594  0.502291
4 -0.093612 -0.990594  0.502291
5  0.474517 -0.990594  0.502291

In [20]:
df.ffill(limit = 2)

          0         1         2
0 -0.063541  0.356909 -0.273050
1  1.465576 -0.990594 -0.524196
2 -0.409368 -0.990594 -1.737939
3  1.497492 -0.990594  0.502291
4 -0.093612       NaN  0.502291
5  0.474517       NaN  0.502291

In [21]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [22]:
# data transformation
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [26]:
data.drop_duplicates(["k1", "k2"], keep = "last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [27]:
# transforming data using a function or mapping
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                    "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [29]:
data["animal"] = data["food"].map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [30]:
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [31]:
# replacing values
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [34]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [35]:
# renaming axis indexes
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                             index = ["Ohio", "Colorado", "New York"],
                             columns = ["one", "two", "three", "four"])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [36]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [37]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [38]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [39]:
data.rename(index = {"OHIO": "INDIANA"},
            columns = {"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [40]:
# discretization and binning
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [41]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [42]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [43]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [44]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [45]:
pd.value_counts(age_categories)

C:\Users\chadr\AppData\Local\Temp\ipykernel_31428\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [46]:
pd.cut(ages, bins, right = False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [47]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [48]:
data = np.random.uniform(size = 20)
pd.cut(data, 4, precision = 2)

[(0.71, 0.94], (0.71, 0.94], (0.026, 0.26], (0.71, 0.94], (0.71, 0.94], ..., (0.026, 0.26], (0.71, 0.94], (0.026, 0.26], (0.026, 0.26], (0.71, 0.94]]
Length: 20
Categories (4, interval[float64, right]): [(0.026, 0.26] < (0.26, 0.48] < (0.48, 0.71] < (0.71, 0.94]]

In [49]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision = 2)

quartiles

[(0.59, 3.16], (-2.69, -0.7], (-2.69, -0.7], (-2.69, -0.7], (-0.041, 0.59], ..., (-0.7, -0.041], (-0.041, 0.59], (-2.69, -0.7], (-0.041, 0.59], (-0.041, 0.59]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.69, -0.7] < (-0.7, -0.041] < (-0.041, 0.59] < (0.59, 3.16]]

In [50]:
pd.value_counts(quartiles)

C:\Users\chadr\AppData\Local\Temp\ipykernel_31428\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-2.69, -0.7]     250
(-0.7, -0.041]    250
(-0.041, 0.59]    250
(0.59, 3.16]      250
Name: count, dtype: int64

In [51]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1]).value_counts()

(-2.6759999999999997, -1.235]    100
(-1.235, -0.0411]                400
(-0.0411, 1.229]                 400
(1.229, 3.159]                   100
Name: count, dtype: int64

In [52]:
# detecting and filtering outliers
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024893     0.034870    -0.026598     0.021113
std       1.016571     0.996625     0.984601     0.987117
min      -4.083900    -3.079313    -2.881821    -2.595850
25%      -0.704377    -0.632399    -0.640945    -0.637333
50%       0.026185     0.003524    -0.030780     0.002137
75%       0.642341     0.716428     0.666979     0.685572
max       3.006162     2.913162     3.021208     3.034865

In [53]:
col = data[2]

col[col.abs() > 3]

65     3.020402
731    3.021208
Name: 2, dtype: float64

In [54]:
data[(data.abs() > 3).any(axis = "columns")]

            0         1         2         3
65   0.051607  0.215068  3.020402  0.347665
124 -3.609262  1.473132  0.505259 -2.030202
333  3.006162  0.605189  0.981763  0.821318
351 -0.453702 -3.079313  0.272031  0.639620
485  0.440058 -3.075421  0.288186 -0.209022
541  0.642649 -1.676526  0.994331  3.034865
731 -0.842881 -1.176526  3.021208 -0.906438
772 -4.083900 -1.806725  1.513490  0.631479

In [55]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.023206     0.035025    -0.026640     0.021078
std       1.010814     0.996148     0.984473     0.987011
min      -3.000000    -3.000000    -2.881821    -2.595850
25%      -0.704377    -0.632399    -0.640945    -0.637333
50%       0.026185     0.003524    -0.030780     0.002137
75%       0.642341     0.716428     0.666979     0.685572
max       3.000000     2.913162     3.000000     3.000000

In [56]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

In [57]:
# permutation and random sampling
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [58]:
sampler = np.random.permutation(5)
sampler

array([3, 4, 1, 0, 2])

In [59]:
df.take(sampler)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20

In [60]:
df.iloc[sampler]

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20

In [61]:
column_sampler = np.random.permutation(7)
column_sampler

array([0, 1, 4, 5, 6, 3, 2])

In [62]:
df.take(column_sampler, axis = "columns")

    0   1   4   5   6   3   2
0   0   1   4   5   6   3   2
1   7   8  11  12  13  10   9
2  14  15  18  19  20  17  16
3  21  22  25  26  27  24  23
4  28  29  32  33  34  31  30

In [63]:
df.sample(n = 3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [64]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n = 10, replace = True)

4    4
0    5
1    7
0    5
2   -1
0    5
2   -1
0    5
1    7
0    5
dtype: int64

In [65]:
# computing indicator / dummy variables
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [66]:
pd.get_dummies(df["key"], dtype = float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [67]:
dummies = pd.get_dummies(df["key"], prefix = "key", dtype = float)
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [68]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("https://raw.githubusercontent.com/wesm/pydata-book/3rd-edition/datasets/movielens/movies.dat",
                       sep = "::", header = None, names = mnames, engine = "python")

In [69]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [70]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [71]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [72]:
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size = 10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [73]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [74]:
# extension data types
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [75]:
s.dtype

dtype('float64')

In [76]:
s = pd.Series([1, 2, 3, None], dtype = pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [77]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [78]:
s.dtype

Int64Dtype()

In [79]:
s[3]

In [80]:
s[3] is pd.NA

True

In [81]:
s = pd.Series([1, 2, 3, None], dtype = "Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [82]:
s = pd.Series(["one", "two", None, "three"],
              dtype = pd.StringDtype())

s

0      one
1      two
2     <NA>
3    three
dtype: string

In [83]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})

df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [84]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")

df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [85]:
# string manipulation
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [86]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [87]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [88]:
"..".join(pieces)

'a..b..guido'

In [89]:
"guido" in val

True

In [90]:
val.index(",")

1

In [92]:
val.find(":")

-1

In [94]:
val.count(",")

2

In [95]:
val.replace(",", "::")

'a::b::  guido'

In [96]:
val.replace(",", "")

'ab  guido'

In [97]:
# regular expressions
import re

text = "foo   bar\t baz  \tquz"

re.split(r"\s+", text)

['foo', 'bar', 'baz', 'quz']

In [98]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'quz']

In [99]:
regex.findall(text)

['   ', '\t ', '  \t']

In [100]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

regex = re.compile(pattern, flags = re.IGNORECASE)

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [102]:
m = regex.search(text)
m

In [103]:
text[m.start():m.end()]

'dave@google.com'

In [104]:
print(regex.match(text))

None

In [105]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [106]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

regex = re.compile(pattern, flags = re.IGNORECASE)
m = regex.match("wesm@bright.net")

m.groups()

('wesm', 'bright', 'net')

In [107]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [108]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [ ]:
# string functions in pandas